class ArabicModel {
  final String title;
  final String desc;
  final String audio;

  ArabicModel({required this.title, required this.desc, required this.audio});
}

List<ArabicModel> araContents = [
  ArabicModel(
      title: "الادب العربي",
      desc:
          'الأدب العربي هو تراث ثقافي غني يمتد لآلاف السنين. يعتبر الأدب العربي من بين أعظم التراث الأدبي في العالم ويشتهر بالإبداع والجمالية اللغوية. يمتاز الأدب العربي بتنوعه وتعدد أشكاله وتعابيره، وهو يشمل الشعر، الرواية، المسرح، القصة القصيرة، وغيرها من الأشكال الأدبية.',
      audio: 'assets/sound/1.mp3'),
  ArabicModel(
      title: "تاريخ الأدب العربي",
      desc:
          'تاريخ الأدب العربي يمتد إلى العصور القديمة مع ظهور الشعر الجاهلي قبل الإسلام، واستمر التطور والتأثير على مدار العصور. أحد أعظم الشعراء العرب هو الشاعر الجاهلي أمرؤ القيس، ومن بين أبرز الشعراء العرب اللاحقين المتأثرين بالإسلام هم الإمام الشافعي وأبو الطيب المتنبي وأبو العلاء المعري.',
      audio: 'assets/sound/1.mp3'),
  ArabicModel(
      title: "الأدب العربي الحديث.",
      desc:
          'فيما يتعلق بالرواية، لها مكانة هامة في الأدب العربي الحديث. تتنوع الروايات العربية من حيث المواضيع والأساليب، وتحظى بشهرة عالمية. من أبرز الروائيين العرب: نجيب محفوظ، غسان كنفاني، أحلام مستغانمي، وعبد الرحمن منيف.',
      audio: 'assets/sound/2.mp3'),
  ArabicModel(
      title: "الأدب العربي بالمسرحيات",
      desc:
          'ما في المسرح، فقد ازدهر الأدب العربي بالمسرحيات المميزة. يعتبر توفيق الحكيم من أعظم كتّاب المسرح في العالم العربي، وأعماله مثل "الملك لير" و"صلاح الدين" لا تزال تحظى بشهرة واسعة حتى اليوم.',
      audio: 'assets/sound/3.mp3'),
  ArabicModel(
      title: "الأدب العربي بالمسرحيات",
      desc:
          'تعد الثقافة العربية من أهم المصادر للإلهام والتأثير في الأدب العالمي، حيث يتمتع الأدب العربي بعمق فلسفي واجتماعي وثقافي. إن دراسة الأدب العربي تعزز الفهم الثقافي وتثر.',
      audio: 'assets/sound/4.mp3'),
  ArabicModel(
      title: "الأعمال الكلاسيكية في الأدب العربي",
      desc:
          'تعتبر الأعمال الكلاسيكية في الأدب العربي، مثل الشعراء المشهورين مثل الشاعر أحمد شوقي والشاعر الجاهلي عنترة بن شداد، والمؤلفين المشهورين مثل الكاتب الشهير جبران خليل جبران والروائي العراقي الشهير محمد الراوي والشاعر السوري نزار قباني وغيرهم. تتميز هذه الأعمال بالإبداع الشديد والتأثير القوي على الثقافة والأدب العربي.',
      audio: 'assets/sound/5.mp3'),
  ArabicModel(
      title: "تطور الأدب العربي",
      desc:
          'وفي الوقت الحاضر، يستمر الأدب العربي في التطور والتعاقد مع العالم الحديث ويتمتع بشعبية كبيرة في العالم العربي وحول العالم. ومن بين الكتاب الحديثين الأكثر شهرة مثل الروائي المصري نجيب محفوظ والروائي السوري خالد الخيام والروائي اللبناني جبران تويني والشاعرة الفلسطينية ميمونة سنون وغيرهم. ',
      audio: 'assets/sound/6.mp3'),
  ArabicModel(
      title: " الشعر العربي",
      desc:
          'الشعر العربي يعتبر أحد أعظم تجليات الأدب العربي ويحتل مكانة مرموقة في التراث الأدبي والثقافي للعالم العربي. يعود تاريخ الشعر العربي إلى العصور القديمة حيث كان يستخدم للتعبير عن المشاعر والأفكار والتجارب الإنسانية.',
      audio: 'assets/sound/7.mp3'),
  ArabicModel(
      title: "ما يتميز الشعر العربي",
      desc:
          'يتميز الشعر العربي بتنوع أشكاله وأنماطه، بدءًا من القصائد النبطية الشعرية التي تركز على الفخر القبلي والشجاعة والحب للوطن، وصولاً إلى القصائد الغنائية والحب والشعر الرومانسي، والشعر الديني والفلسفي.',
      audio: 'assets/sound/8.mp3'),
];
