class HistoryModel {
  final String title;
  final String desc;

  HistoryModel({
    required this.title,
    required this.desc,
  });
}

List<HistoryModel> araContents = [
  HistoryModel(
    title: "ماهية التاريخ",
    desc: 'لتاريخ هو علم يدرس الماضي والأحداث التي وقعت فيه، ويتناول تسجيل ودراسة الأحداث والتطورات التي حدثت على مر الزمان. يعتبر التاريخ أداة هامة لفهم تطور البشرية وتأثيرها على العالم.',
  ),
  HistoryModel(
    title: "انواع التاريخ",
    desc: 'يشمل التاريخ دراسة الحضارات القديمة والثقافات والأمم، والتغيرات الاجتماعية والسياسية والاقتصادية التي شهدتها البشرية عبر العصور. يهتم التاريخ بتحليل وتفسير الأحداث وتحديد الأسباب والنتائج والتأثيرات المترتبة عليها.',
  ),
  HistoryModel(
      title: "مصادر التاريخ.",
      desc: 'يستخدم المؤرخون مصادر متنوعة للحصول على المعلومات التاريخية، مثل الوثائق التاريخية والسجلات والمخطوطات والأثرية والمصادر الشفهية. ويعتمدون على تحليل وتفسير هذه المصادر لإنتاج رواية موثوقة ومنطقية للأحداث التاريخية.'
  ),
  HistoryModel(
      title: "افسام التاريخ",
      desc: 'يمكن تقسيم التاريخ إلى فترات زمنية مختلفة، مثل العصور القديمة والوسطى والحديثة، ويمكن أيضًا تصنيفه حسب المناطق الجغرافية أو الثقافات. وتساعد دراسة التاريخ في فهم الهوية والتراث الثقافي للشعوب والأمم، وتوفير تجارب ومعارف تساهم في بناء المستقبل.'
  ),
  HistoryModel(
    title: "تقسيم الزمن",
    desc:
    'تقسيم الزمن: يتم تقسيم التاريخ إلى فترات زمنية مختلفة. يستخدم التقسيم الشائع الزمن المسيحي (قبل الميلاد وبعد الميلاد)، ولكن هناك أيضًا تقسيمات أخرى مثل العصور القديمة والوسطى والحديثة.',
  ),
  HistoryModel(
    title: "المصادر التاريخية",
    desc:
    'المصادر التاريخية: يعتمد المؤرخون على مصادر متنوعة للحصول على المعلومات التاريخية. من بين هذه المصادر: الوثائق التاريخية والسجلات الرسمية والمخطوطات والأثار والتماثيل والأدلة الأثرية الأخرى.',
  ),
  HistoryModel(
    title: "تطور الأدب العربي",
    desc:
    'وفي الوقت الحاضر، يستمر الأدب العربي في التطور والتعاقد مع العالم الحديث ويتمتع بشعبية كبيرة في العالم العربي وحول العالم. ومن بين الكتاب الحديثين الأكثر شهرة مثل الروائي المصري نجيب محفوظ والروائي السوري خالد الخيام والروائي اللبناني جبران تويني والشاعرة الفلسطينية ميمونة سنون وغيرهم. ',
  ),
  HistoryModel(
    title: "العلم التاريخي",
    desc:
      'العلم التاريخي: التاريخ ليس مجرد تسجيل للأحداث، بل هو علم يعتمد على المنهج العلمي. يتضمن ذلك تحليل الأدلة والمصادر، والتفسير والتفاعل مع النصوص التاريخية والمواد الأثرية.'
  ),
  HistoryModel(
      title: "ما يتميز به التريخ ",
      desc:'المدارس التاريخية: هناك مدارس ومنهجيات مختلفة في دراسة التاريخ. تشمل بعض المدارس التاريخية المادية والتي تركز على الأحداث والظروف المادية، بينما تركز المدارس الثقافية على الثقافة والأفكار والقيم. وهناك أيضًا المدارس الاجتماعية والتي تركز على التفاعلات الاجتماعية والاقتصادية.'
  ),
];
